Revit 2027 API
ExternalServices.BuiltInExternalServices.ExternalDataTypeService Property
 Unique service id.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ExternalDataTypeService { get; }
Public Shared ReadOnly Property ExternalDataTypeService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ExternalDataTypeService {
	ExternalServiceId^ get ();
}
static member ExternalDataTypeService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace